#位运算符加密解密
#&与位运算符
#|或位运算符
#^异或位运算符
#~取反位运算符
#<<左移位运算符
#>>右移位运算符


ymm1 = int(input("请输入纯数字&与位运算符加密密码："))
key1 = int(input("请输入纯数字&与位运算符加密密匙："))
mm1 = ymm1 & key1#&与位运算符加密
print("加密后秘密：",mm1)

ymm2 = int(input("请输入纯数字|或位运算符加密密码："))
key2 = int(input("请输入纯数字|或位运算符加密密匙："))
mm2 = ymm2 | key2#|或位运算符加密
print("加密后密码为：",mm2)


ymm3 = int(input("请输入纯数字异或位运算符加密密码："))
key3 = int(input("请输入纯数字异或位运算符加密密匙："))
mm3 = ymm3 ^ key3##异或位运算符加密
print("加密后密码为：",mm3)
print("解密后的密码：",mm3^key3)##异或位运算符解密


ymm4 = int(input("请输入纯数字取反位运算符密码："))
mm4 = ~ymm4##取反位运算符加密
print("加密后密码为：",mm4)
print("解密后密码为：",~mm4)##取反位运算符解密


ymm5 = int(input("请输入纯数字左移位运算符密码："))
key5 = int(input("请输入纯数字左移位运算符密匙："))
mm5 = ymm5 << key5##左移位运算符加密
print("加密后密码为：",mm5)
print("加密后密码为：",mm5>>key5)##左移位运算符解密


ymm6 = int(input("请输入纯数字右移位运算符密码："))
key6 = int(input("请输入纯数字右移位运算符密匙："))
mm6 = ymm6 >> key6##右移位运算加密
print("加密后密码为：",mm6)
print("解密后密码为：",mm6<<key6)##右移位运算解密
