#int整型
a=2
print("int整型:","a=",a,"\n")

#float浮点型
b=2.2
print("float浮点型:","b=",b,"\n")

#str字符串
c="2"
d="字符串"
print("str字符串:","c=",c,"d=",d,"\n")

#bool布尔值
e=False
f=True
print("bool布尔值:","e=",e,"or","f=",f,"\n")

#None空值
g=None
print("None空值","g=",g,"\n",
      "tupe(g)=",type(g),"(用type()函数来获取数值类型)","\n")

#运算符优先级
print("运算符优先级: 圆括号() > 幂运算符** > 单目运算符：取反~,负号- > 算术运算符：乘*,除/,整除//,取余% > 加+,减- > 位运算符：<<,>>,&,^,| > 比较运算符：<,<=,>,>=,!=,==","\n")

#关系运算符
print("关系运算符:等于==  不等于!=  大于>  小于<  大于等于>=  小于等于<=","\n",
      "(关系运算符返回布尔值)","\n")

#赋值运算符
print("赋值运算符:","简单赋值运算符=","\n",
      "加法赋值运算符+=","例:a+=b等同于a=a+b","\n",
      "减法赋值运算符-=","例:a-=b等同于a=a-b","\n",
      "乘法赋值运算符*=","例:a*=b等同于a=a*b","\n",
      "除法赋值运算符/=","例:a/=b等同于a=a/b","\n",
      "幂赋值运算符**=","例:a**=b等同于a=a**b","\n",
      "取模赋值运算符%=","例:a%=b等同于a=a%b","\n",
      "取整赋值运算符//=","例:a//=b等同于a=a//b","\n",)

#逻辑运算符
print("逻辑运算符:","与and",  "或or",  "取反not","\n",
      "(逻辑运算符返回布尔值)","\n")

#位运算符
& 位于运算符，二进制有零为零
| 位或运算符，二进制有一为一
^ 位异或运算符，二进制相同为一，不同为零
~ 位取反运算符，二进制有一为零，有零为一
<< 左移位运算符，二进制整体向左移动一位，首位舍去，末位补零
>> 右移位运算符，二进制整体向右移动一位，首位补零，末位舍去

#转义字符
print (r"转义字符:\t:表示空格","\n",r"\n:表示换行","\n","r:str字符串前+r表示取消转义","\n")

#int整型+—int整型
print("int整型+ -int整型:","a+a=",a+a,"a-a=",a-a)
#int整型*/int整型
print("int整型* /int整型:","a*a=",a*a,"a/a=",a/a,"\n")

#float浮点型+ -float浮点型
print("float浮点型+ -float浮点型:","b+b=",b+b,"b-b=",b-b)
#float浮点型* /float浮点型
print("float浮点型* /float浮点型:","b*b=",b*b,"b/b=",b/b,"(float浮点数不能进行精确计算)","\n")

#str字符串+str字符串
print("str字符串+str字符串:","c+d=",c+d,"\n",
      "(str字符串间相互运算必须先将其转换为相同类型且可运算的数据类型)","\n")

#bool布尔值+ - * /bool布尔值
print("bool布尔值+ - * /bool布尔值:","e+f=",e+f,"e-f=",e-f,"e*f=",e*f,"e/f=",e/f,"\n",
      "(bool布尔值被计算机储存为0False和1True,bool布尔值可进行and、or、not的运算,and用&表示,or用|表示)","\n")

#数据类型转换
print("数据类型转换:","int()转换成整型","\n",
      "float()转换成浮点型","\n",
      "str()转换成字符串","\n",
      "bool()转换成布尔值(转换空值、空字符串、0时,转换为False,其他为True)\n",
      "(数据转换前提是形态相同)","\n")
